src/cf/InformationRegisters/СотрудникиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СотрудникиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СотрудникиПользователей/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить(
		"ПараметрыОбновленияДанныхКэширующихОбъектов",
		РегистрыСведений.СотрудникиПользователей.ЗначенияПараметровОбновленияДанныхКэширующихОбъектов(ЭтотОбъект));
	
	ЭтоУдаление = Количество() = 0;	
	Если ЭтоУдаление Тогда
		
		СтарыеЗаписи = НаборСтарыхЗаписей();
		ДополнительныеСвойства.Вставить("СтарыеЗаписи", СтарыеЗаписи);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.СотрудникиПользователей.ОбновитьДанныеКэширующихОбъектов(
		ЭтотОбъект, ДополнительныеСвойства.ПараметрыОбновленияДанныхКэширующихОбъектов);
	
	ЗапротоколироватьДобавлениеВСписокСотрудников();
	ЗапротоколироватьУдалениеИзСпискаСотрудников();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НаборСтарыхЗаписей()
	
	НаборСтарыхЗаписей = РегистрыСведений.СотрудникиПользователей.СоздатьНаборЗаписей();
		
	Для Каждого ЭлементОтбора Из Отбор Цикл
		НаборСтарыхЗаписей.Отбор[ЭлементОтбора.Имя].Установить(ЭлементОтбора.Значение);
	КонецЦикла;
		
	НаборСтарыхЗаписей.Прочитать();
	Возврат НаборСтарыхЗаписей;
			
КонецФункции

Процедура ЗапротоколироватьДобавлениеВСписокСотрудников()
	
	Для Каждого НоваяЗапись Из ЭтотОбъект Цикл
		
		ПротоколированиеРаботыСотрудников.ЗаписатьДобавлениеВСписокСотрудниковПользователя(
			НоваяЗапись.Сотрудник, НоваяЗапись.Пользователь);
			
	КонецЦикла;
			
КонецПроцедуры

Процедура ЗапротоколироватьУдалениеИзСпискаСотрудников()
	
	Если ДополнительныеСвойства.Свойство("СтарыеЗаписи") Тогда
	
		Для Каждого СтараяЗапись Из ДополнительныеСвойства.СтарыеЗаписи Цикл
		
			ПротоколированиеРаботыСотрудников.ЗаписатьУдалениеИзСпискаСотрудниковПользователя(
				СтараяЗапись.Сотрудник, СтараяЗапись.Пользователь);
		
		КонецЦикла;
	
	КонецЕсли;
			
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
